# running in verify/formal/e1_axi_lite_interconnect_bmc/src/
read -define AXIL_PROTO_ASSUME_LIVENESS
read -formal -sv axi_lite_protocol.sv
read -formal e1_axi_lite_interconnect.sv
read -formal e1_axi_lite_interconnect_bind.sv
prep -top e1_axi_lite_interconnect_props_top

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
