[tasks]
bmc
prove

[options]
bmc: mode bmc
bmc: depth 12
prove: mode prove
prove: depth 8
multiclock off

[engines]
smtbmc z3
smtbmc bitwuzla

[script]
plugin -i slang
read_slang --std 1800-2017 --single-unit -I . --top e1x_credit_router_formal e1x_credit_router.sv e1x_credit_router_formal.sv
prep -top e1x_credit_router_formal
async2sync

[files]
rtl/e1x/e1x_credit_router.sv
verify/formal/e1x/e1x_credit_router_formal.sv
rtl/e1x/e1x_pkg.sv rtl/e1x/e1x_pkg.sv
